[{"title":"Custom Dog Name t-shirt, Dog Mom t-shirt, Dog Lover t-shirt, Dog People t-shirt, New Dog Owner t-shirt, Pet Lover t-shirt","price":"Price:\nUSD 16.93+","description":"Honor the special connection you share with your furry friends by wearing this unique, customizable t-shirt.\nThis stylish personalized (with your pets name) t-shirt, is a chic addition to any aesthetic and is sure to spark conversations. Whether for yourself or as a thoughtful gift for another dog lover, or even as a beautiful memorial tribute, this lovingly crafted pet t-shirt is available in various sizes and hues to suit every taste.\nThis classic unisex jersey short sleeve tee fits like a well-loved favorite. Soft cotton and quality print make users fall in love with it over and over again. These t-shirts have-ribbed knit collars to bolster shaping. The shoulders are tapered for a better fit over time. Dual side seams hold the garment's shape for longer.\n-Made with 100% Airlume combed and ring-spun cotton, a lightweight fabric (4.2 oz/yd² (142 g/m²)) that is easy to layer, breathable. Perfect for active and leisure wear.\n-The retail fit that is perfect for casual and semi-formal settings. The crew neckline adds a classic, neat style that's perfect for accessorizing.\n-Bella+Canvas manufactures all its products in the US and internationally in humane, no-sweat-shop, sustainable way and is part of the Fair Labor Association as well as Platinum WRAP certified.\n-The tear-away label minimizes skin irritations.\n-Fabric blends: Ash and Heather Prism colors - 99% Airlume combed and ring-spun cotton, 1% polyester; Heather colors - 52% cotton, 48% polyester; Athletic Heather and Black Heather - 90% cotton, 10% polyester.","sizes":["Select an option","Athletic Heather (USD 16.93 - USD 24.15)","Heather Kelly (USD 16.93 - USD 24.15)","Heather Red (USD 16.93 - USD 24.15)","Heather Team Purple (USD 17.55 - USD 25.28)","Heather True Royal (USD 16.93 - USD 24.15)","Pink (USD 16.93 - USD 24.15)","White (USD 16.93 - USD 24.15)","Heather Peach (USD 16.93 - USD 24.15)","Heather Aqua (USD 17.55 - USD 25.28)","Heather Ice Blue (USD 16.93 - USD 24.15)","Heather Olive (USD 16.93 - USD 24.15)","Heather Mauve (USD 16.93 - USD 24.15)"],"imageURL":"https://i.etsystatic.com/50442426/r/il/c8e790/5860510834/il_794xN.5860510834_s5a1.jpg"},{"title":"Amber Jack Swim Shack Women's Butterfly shirt","price":"Price:\nUSD 35.00","description":"Hand Sublimated and sewn all polyester UPF 50 shirt.","sizes":["Select an option","YXS US letter","YS US letter","YM US letter","YL US letter","XS US letter","S US letter","M US letter","L US letter","XL US letter","2X US letter","3X US letter","4X US letter"],"imageURL":"https://i.etsystatic.com/45182436/r/il/1d5de8/5153085061/il_794xN.5153085061_5mwp.jpg"},{"title":"Womens Pickleball T-shirt \"When Life Has You in a Pickle, Lets Ball\"","price":"Price:\nUSD 24.99","description":"Its Pickle Ball time!\n\n- Adult T-shirts\n\n- The shirts are made of 100% cotton, printed and shipped in Florida.\n\n- Please select your color and size with the drop down menu\n\n- IMPORTANT NOTE: light blue is only color with size XXL\n\n-All orders have a 1-3 business day turn around\n\nWashing reccomendations:\n\n- The shirts are 100% cotton so they are suseptible to shrinking, to avoid- wash on cold and tumble dry on low heat.\n\nFitting:\n\n- Womens T-shirt run small - it is reccomended to size up.","sizes":["Select an option","S US letter","M US letter","L US letter","XL US letter","2X US letter"],"imageURL":"https://i.etsystatic.com/34671307/r/il/72116f/4560241134/il_794xN.4560241134_hpkz.jpg"},{"title":"Anglers Paradise Ocean Waves t shirt, Deep sea fishing jersey, Sports Fishing shirt,Ocean life tee,Saltwater fish, Marlin fish, Nautical tee","price":"Price:\nUSD 20.60+","description":"Anglers Paradise Ocean Waves t shirt, Deep sea fishing jersey, Sports Fishing shirt,Ocean life tee,Saltwater fish, Marlin fish, Nautical tee.\n\nHi, welcome to our store! We offer a variety of soft comfortable graphic shirts in a unique and stylish design. Here is some information to help you with the ordering process.\n\nHOW TO ORDER\n1. Select the shirt and styles from the drop down menus above.\n2. Select the quantity\n3. Click ADD TO CART, if you want more than one, please go back to listing and repeat the process.\n4. go to CART and place your order.\n\n** If you want a custom design or different size, please let us know.\n** Please double check your order before checkout, because these are a custom orders and not returnable, once in\nproduction.\n** If you have any questions please send us a message.\n\nSHIRT SIZING AND MATERIAL\nSizing:\nAll shirts are unisex sizing. I recommend WOMEN TO SIZE DOWN ONE SIZE, but it is important to check out the size charts to\ncompare to favorite shirts you already have, as different brands of shirts come in a variety of size standards. Shirts may have\nup to to a +/- variance when compared with the measurements on the sizing chart. This is pretty standard for the clothing\nindustry. This is not a fitted shirt and may be looser in some areas.\nMaterial:\nThis classic unisex jersey short sleeve tee fits like a well-loved favorite. These soft lightweight cotton t-shirts have-ribbed knit\ncollars to bolster shaping. The shoulders have taping for better fit over time. Dual side seams hold the garment's shape for\nlonger.\n.: 100% Airlume combed and ringspun cotton (fiber content may vary for different colors)\n.: Light fabric (4.2 oz/yd² (142 g/m²))\n.: Relaxed fit\n.: Tear away label and runs true to size\n\n**Sweatshirts and Hoodies are usually Gildan medium weight 50/50\n**Color \"Heather\" can be 50/50 polyester/cotton\n\nCARE INSTRUCTIONS:\n-Machine wash warm, inside out, and with like colors\n-Tumble dry low\n-medium iron (do not iron design)\n-do not bleach\n-do not dry clean\n\nSHIPPING AND HANDLING:\n-Handling/Processing: 1-2 business days\n-First Class Mail: 2-5 business days\n*can take longer for custom, out of order materials, and approaching holidays\n\nRETURN POLICY\nUnfortunately since you purchase is made to order we do not accept returns or exchanges unless the item is defective or\ndifferent form what you ordered (please make sure address is correct). So please let us know about any issues.\n\nThank you for your order!\n\nThis classic unisex jersey short sleeve tee fits like a well-loved favorite. Soft cotton and quality print make users fall in love with it over and over again. These t-shirts have-ribbed knit collars to bolster shaping. The shoulders are tapered for a better fit over time. Dual side seams hold the garment's shape for longer.\n.: Made with 100% Airlume combed and ring-spun cotton, a lightweight fabric (4.2 oz/yd² (142 g/m²)) that is easy to layer, breathable. Perfect for active and leisure wear.\n.: The retail fit that is perfect for casual and semi-formal settings. The crew neckline adds a classic, neat style that's perfect for accessorizing.\n.: Bella+Canvas manufactures all its products in the US and internationally in humane, no-sweat-shop, sustainable way and is part of the Fair Labor Association as well as Platinum WRAP certified.\n.: The tear-away label minimizes skin irritations.\n.: Fabric blends: Ash and Heather Prism colors - 99% Airlume combed and ring-spun cotton, 1% polyester; Heather colors - 52% cotton, 48% polyester; Athletic Heather and Black Heather - 90% cotton, 10% polyester.","sizes":["Select an option","Aqua (USD 20.60 - USD 25.67)","Athletic Heather (USD 20.81 - USD 25.90)","Baby Blue (USD 20.60 - USD 25.67)","Dark Grey Heather (USD 20.81 - USD 25.90)","Natural (USD 20.60 - USD 25.67)","Navy (USD 20.60 - USD 25.67)","Pink (USD 20.60 - USD 25.67)","Heather Peach (USD 20.81 - USD 25.90)"],"imageURL":"https://i.etsystatic.com/36952755/r/il/e9e411/5689657308/il_794xN.5689657308_fhvk.jpg"},{"title":"F1 Ferrari jacket - Formula 1 - Racing pilot jacket - 90s Streetwear Racing Jacketnasca car jacket y2k style jacket - best gift","price":"Price:\nUSD 52.70","description":"This Ferrari Racing Jacket is designed for those Ferrari racing fans who have a burning passion for speed and passion. It combines high-performance materials with stylish design, suitable both for intense competition on the track and for showing off your love for Ferrari in everyday life.🎇🎇🎇🎇\n\nMade of lightweight, durable mercerized cotton to ensure a comfortable wearing experience\nClassic Ferrari white, red and black combine to show the perfect balance of power and elegance.\nThe jacket has Ferrari branding on the chest and cuffs to show your support and identification with Ferrari.\n\nPrecisely designed to fit your body, showing off your curves while providing room for free movement.\n\nCleaning Instructions: It is recommended to hand wash or dry clean with cold water and avoid using bleach.\n\nThis Ferrari racing jacket is perfect for:\n\nCar event watching\nDaily leisure\nConcerts and other entertainment events\n\nArrival in Europe within 12 working days\nArrival within 10 working days in the United States\nStrong global shipping, free shipping in some areas!\n\nPlease choose the size that suits you according to the size chart.\nDue to differences in different monitors, the color of the actual product may vary slightly.\nPlease follow the cleaning instructions to keep your jacket in top condition.\nWhether you are a Ferrari racing fan or a fashion enthusiast, this Ferrari Racing Jacket will make you stand out from the crowd and show off your passion and taste for Ferrari. Buy this jacket and let speed and passion accompany you every day!","sizes":["Select a style","BLACK V1","BLACK V2","WHITE V1","WHITE V2 [Sold out]","RED V1","RED V2 [Sold out]"],"imageURL":"https://i.etsystatic.com/49762607/r/il/b33510/5856387878/il_794xN.5856387878_dzvy.jpg"},{"title":"The Suryoye Legacy Unisex T-Shirt","price":"Price:\nUSD 32.50+","description":"Embrace Your Heritage with Elegance: The Suryoye Legacy T-Shirt In a world where roots are everything, and culture is the soul's language, it brings you more than just a garment; it's a statement of resilience, unity, and pride. This pure white, cotton t-shirt, adorned with our iconic logo in bold black—featuring minimalist text and a poignant cross—speaks volumes of a heritage that thrives beyond borders. Crafted for both men and women of Aramaic descent, aged 14 to 60 or older, our t-shirt transcends age, embodying the spirit of a people dispersed yet undivided. It's a modern tribute to our heritage, the only legacy we carry in the absence of a homeland.\nThe Suryoye Legacy T-shirt isn’t just apparel; it's a new dawn for the Aramaic culture, a symbol that unites us all, wherever we are in the world.\nBe unique. Be culture. Be Suryoyo.","sizes":["Select an option","S (USD 32.50)","M (USD 32.50)","L (USD 32.50)","XL (USD 32.50)","2XL (USD 37.09)","3XL (USD 41.26)","4XL (USD 52.20)","5XL (USD 57.01)"],"imageURL":"https://i.etsystatic.com/47905485/r/il/455a31/5856880786/il_794xN.5856880786_ohjd.jpg"},{"title":"Ferrari Jacket, F1 Jacket, Racing Jacket, Vintage F1 Jacket, Ferrari F1, Old School Jacket, F1 Fan Jacket, Formula One Merch, Red bull","price":"Price:\nUSD 60.15","description":"🏎️ Rev up your style with our vintage Ferrari F1 jacket, perfect for motorsport enthusiasts and Formula One fans alike. Crafted with a nostalgic old-school flair, this racing jacket exudes the essence of Formula One heritage. Made for both fashion and function, it's an aesthetic statement piece that captures the spirit of the track. Whether you're cheering on your favorite team or cruising the streets, this Ferrari jacket embodies the essence of speed and precision. Treat yourself or surprise a racing aficionado with this timeless gift, a must-have addition to any collection of Formula One merch.\n\n🏁 Shipping 6-12 days\n\n✍️ If you have any questions, feel free to message me here on Etsy :)","sizes":["Select an option","M","L","XL","2XL","S - out of stock"],"imageURL":"https://i.etsystatic.com/50731327/r/il/f99c9f/5841855724/il_794xN.5841855724_t93b.jpg"},{"title":"Unisex Heavy Cotton Tee Titanic","price":"Price:\nUSD 20.16+","description":"The unisex heavy cotton tee is the basic staple of any wardrobe. It is the foundation upon which casual fashion grows. All it needs is a personalized design to elevate things to profitability. The specially spun fibers provide a smooth surface for premium printing vividity and sharpness. No side seams mean there are no itchy interruptions under the arms. The shoulders have tape for improved durability.\n.: Made with medium fabric (5.3 oz/yd² (180 g/m²)) consisting of 100% cotton for year-round comfort that is sustainable and highly durable.\n.: The classic fit of this shirt ensures a comfy, relaxed wear while the crew neckline adds that neat, timeless look that can blend into any occasion, casual or semi-formal.\n.: The tear-away label means a scratch-free experience with no irritation or discomfort whatsoever.\n.: Made using 100% US cotton that is ethically grown and harvested. Gildan is also a proud member of the US Cotton Trust Protocol ensuring ethical and sustainable means of production. This blank tee is certified by Oeko-Tex for safety and quality assurance.","sizes":["Select an option","Dark Heather (USD 20.72 - USD 29.05)","Red (USD 20.16 - USD 27.91)","Tropical Blue (USD 20.72 - USD 29.05)","White (USD 20.16 - USD 27.91)","Black (USD 20.16 - USD 27.91)"],"imageURL":"https://i.etsystatic.com/51103318/r/il/a17e11/5857674628/il_794xN.5857674628_306r.jpg"},{"title":"Ralph Lauren Cable Knit Crew Neck Sweater - Mens and Womens V-Neck Options For Women Logo Cotton Jumper Long Sleeves S-XXL Sizes","price":"Price:\nUSD 41.35+","description":"Elevate your wardrobe with the timeless sophistication of the Ralph Lauren Cable Knit Crew Neck Sweater. Available in both mens and womens versions, this jumper offers a chic and stylish option for any occasion. Crafted from breathable cotton, this sweater provides a perfect fit that will flatter your silhouette. The iconic Ralph Lauren logo on the front adds a touch of prestige to your look.\n\nUse our size guide to ensure a personalized fit for maximum confidence when wearing this classic long-sleeved sweater. Whether you're heading out for a night on the town or want to elevate your everyday style, this versatile sweater will guarantee a polished appearance. It also makes a great gift for any fashion-forward individual.\n\nChoose from a variety of colors, including Black, Navy, White, and Grey, to suit your personal style. The sweater is available in sizes S, M, L, XL, and XXL, so you can find the perfect fit for your body. The womens version also comes in a V-neck style, as seen in the images.\n\nMake a statement with the Ralph Lauren Cable Sweater and experience the lasting elegance of this iconic fashion brand. Review our detailed size guide for precise measurements in inches to find the best fit for you. Elevate your wardrobe and add a touch of luxury to any outfit with the Ralph Lauren Cable Knit Crew Neck Sweater.","sizes":["Select an option","White","Black","Grey","Navy"],"imageURL":"https://i.etsystatic.com/50953406/r/il/853ebc/5854508496/il_794xN.5854508496_sfm8.jpg"},{"title":"ICONIC TITS - Crop Top (Sassy Collection)","price":"Price:\nUSD 26.99","description":"*ONLY 9 ITEMS PER DESIGN!\n\nGet ready to exude style and fun with our SASSY COLLECTION! This limited edition and exclusive line features 9 designs printed on crop tops made to highlight your curves with a touch of sensuality. Each top comes with a phrase that will make everyone perceive you as a confident, funny and independent woman and look at you with admiration. It's the perfect gift for your girlfriend, bestie or for you! Ideal for those relaxed days with friends or for an afternoon of laughter in the sun. Get yours and turn every day into a fun sexy party!\n\nThe must-have garment of the season. This t-shirt features a snug fit but remains extremely comfortable. It sits just above the navel.\n• 52% combed and ring-spun cotton, 48% polyester\n• Fabric weight: 122 g/m² (3.6 oz/yd²)\n• Slim fit\n• Side-seamed\n• Base product sourced from Nicaragua, USA, or Honduras\n\nSanBibofy\n\nKEYWORDS: ICONIC TITS, crop top, custom tee, 90s style tee, trendy shirt, y2k clothing, clothes, woman gift, sexy tee, girlfriend gift, girly, pink","sizes":["Select an option","XS/SM","M/L"],"imageURL":"https://i.etsystatic.com/50943678/r/il/c70cb8/5847472416/il_794xN.5847472416_nuha.jpg"}]